//
//  ViewController.h
//  BMChineseSortDemo
//
//  Created by Baymax on 16/7/15.
//  Copyright © 2016年 Baymax. All rights reserved.
//

#import "ViewController.h"
#import "BMChineseSort.h"
#import "Person.h"

@interface ViewController (){
    NSMutableArray<Person *> *dataArray;
}
//排序后的出现过的拼音首字母数组
@property(nonatomic,strong)NSMutableArray *firstLetterArray;
//排序好的结果数组
@property(nonatomic,strong)NSMutableArray *sortedModelArr;
@end

@implementation ViewController

- (void)viewDidLoad {
    [super viewDidLoad];

    dataArray = [self getData];
    
    //根据Person对象的 name 属性 按中文 对 Person数组 排序
    self.firstLetterArray = [BMChineseSort IndexWithArray:dataArray Key:@"name"];
    self.sortedModelArr = [BMChineseSort sortObjectArray:dataArray Key:@"name"];
}

//加载模拟数据
-(NSMutableArray<Person *>*)getData{
    //模拟网络请求接收到的数组对象 Person数组
    NSMutableArray *temp = [NSMutableArray array];
    NSArray *nameArr=[NSArray arrayWithObjects:
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      @"李白",@"张三",@"重庆",@"重量",@"调节",@"调用",@"小白",@"小明",@"千珏",@"黄家驹",@"鼠标",@"hello",@"多美丽",@"肯德基",
                      @"##",@"@@",@"$$",@"0",@"1",@"2",@"3",@"4",@"5",@"6",@"7",@"8",@"9",
                      nil];
    //创建 模型 数组
    for (int i = 0; i<[nameArr count]; i++) {
        Person *p = [[Person alloc] init];
        p.name = nameArr[i];
        p.number = i;
        [temp addObject:p];
    }
    return temp;
}

#pragma mark - UITableView -
//section的titleHeader
- (NSString *)tableView:(UITableView *)tableView titleForHeaderInSection:(NSInteger)section {
    return [self.firstLetterArray objectAtIndex:section];
}
//section行数
-(NSInteger)numberOfSectionsInTableView:(UITableView *)tableView{
    return [self.firstLetterArray count];
}
//每组section个数
- (NSInteger)tableView:(UITableView *)tableView numberOfRowsInSection:(NSInteger)section{
    return [self.sortedModelArr[section] count];
}
//section右侧index数组
-(NSArray *)sectionIndexTitlesForTableView:(UITableView *)tableView{
    return self.firstLetterArray;
}
//点击右侧索引表项时调用 索引与section的对应关系
- (NSInteger)tableView:(UITableView *)tableView sectionForSectionIndexTitle:(NSString *)title atIndex:(NSInteger)index{
    return index;
}
//返回cell
- (UITableViewCell *)tableView:(UITableView *)tableView cellForRowAtIndexPath:(NSIndexPath *)indexPath{
    UITableViewCell *cell = [tableView dequeueReusableCellWithIdentifier:@"CELL"];
    if (cell == nil){
        cell = [[UITableViewCell alloc] initWithStyle:UITableViewCellStyleDefault reuseIdentifier:@"CELL"];
    }
    //获得对应的Person对象<替换为你自己的model对象>
    Person *p = self.sortedModelArr[indexPath.section][indexPath.row];
    cell.textLabel.text = p.name;
    return cell;
}





@end
